## Data analysis on titanic dataset

In [ ]:
## steps
1:collect dataset
2:prepare dataset

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('dataset/train.csv')

In [8]:
df.head()   #to display top 5 records
#survived: target col.
#rest : features

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
for i in df.groupby('Pclass'):
    print(type(i[1]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [34]:
df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
## unique values we have target col

In [11]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [30]:
#df[["Sex", "Survived"]].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False)

## find relationship between target col. and other features

In [22]:
df[df.Sex=='male'].Survived.value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [19]:
233/314

0.7420382165605095

In [24]:
df[['Sex','Survived']].groupby('Sex',as_index=False).mean()

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [28]:
df[['SibSp','Survived']].groupby('SibSp',as_index=False).mean()

   SibSp  Survived
0      0  0.345395
1      1  0.535885
2      2  0.464286
3      3  0.250000
4      4  0.166667
5      5  0.000000
6      8  0.000000

In [25]:
df.Pclass.unique()

array([3, 1, 2])

In [14]:
df[['Pclass','Survived']].groupby('Pclass',as_index=False).mean()

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [ ]:
df.

In [29]:
df[['Parch','Survived']].groupby('Parch',as_index=False).mean()

   Parch  Survived
0      0  0.343658
1      1  0.550847
2      2  0.500000
3      3  0.600000
4      4  0.000000
5      5  0.200000
6      6  0.000000

In [36]:
df.Fare.agg(['max','min','mean','median'])

max       512.329200
min         0.000000
mean       32.204208
median     14.454200
Name: Fare, dtype: float64

In [35]:
df.Age.agg(['max','min','mean','median'])

max       80.000000
min        0.420000
mean      29.699118
median    28.000000
Name: Age, dtype: float64

In [37]:
df.sort_values('Fare',ascending=False)[:5]
#df[df.Fare==0.0].Sex.value_counts()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S

In [38]:
df[df.Fare==0.0].Survived.value_counts()

0    14
1     1
Name: Survived, dtype: int64

In [26]:
df[(df.Fare==0.0)&(df.Survived==0)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

In [29]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [32]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [33]:
df[df.Embarked=='S'].Survived.value_counts()

0    427
1    217
Name: Survived, dtype: int64

In [34]:
df[df.Embarked=='C'].Survived.value_counts()

1    93
0    75
Name: Survived, dtype: int64

In [35]:
df[df.Embarked=='Q'].Survived.value_counts()

0    47
1    30
Name: Survived, dtype: int64

In [40]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### might have useful columns: Age,Fare,Sex,Embarked,Pclass

In [39]:
df[['Embarked','Survived']].groupby('Embarked',as_index=False).mean()

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.336957

In [28]:
#df.Pclass.value_counts()
df[(df.Pclass==3)].Survived.value_counts()

0    372
1    119
Name: Survived, dtype: int64

In [30]:
df[(df.Pclass==2)].Survived.value_counts()

0    97
1    87
Name: Survived, dtype: int64

In [31]:
df[(df.Pclass==1)].Survived.value_counts()

1    136
0     80
Name: Survived, dtype: int64

In [7]:
df.Fare.agg(['max','min','mean','median'])

max       512.329200
min         0.000000
mean       32.204208
median     14.454200
Name: Fare, dtype: float64

In [38]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [39]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [36]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [42]:
df1 = df[['Pclass','Sex','Age','Fare','Embarked']]

In [43]:
df1.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  22.0   7.2500        S
1       1  female  38.0  71.2833        C
2       3  female  26.0   7.9250        S
3       1  female  35.0  53.1000        S
4       3    male  35.0   8.0500        S

In [129]:
df1.isnull().sum()

Pclass      0
Sex         0
Age         0
Fare        0
Embarked    0
dtype: int64

In [47]:
df1.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [48]:
df1.fillna({'Age':df1.Age.mean(),
           'Embarked':'S'},inplace=True)

/home/vinit/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:6287: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [87]:
df1.head()

   Pclass     Sex   Age     Fare Embarked
0       3    male  22.0   7.2500        S
1       1  female  38.0  71.2833        C
2       3  female  26.0   7.9250        S
3       1  female  35.0  53.1000        S
4       3    male  35.0   8.0500        S

In [88]:
### One hot encoding
df2 = pd.get_dummies(df1[['Sex','Embarked']])

In [89]:
df2.head()

   Sex_female  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0           0         1           0           0           1
1           1         0           1           0           0
2           1         0           0           0           1
3           1         0           0           0           1
4           0         1           0           0           1

In [90]:
df3 = df1.select_dtypes(exclude=['object'])    #
df3.head()

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000
4       3  35.0   8.0500

In [91]:
final_data = pd.concat((df2,df3),axis=1)  # axis=1: for concatenating 2 or more dataframe as a column wise

In [92]:
final_data.head()

,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Pclass,Age,Fare
0,0,1,0,0,1,3,22.0,7.2500
1,1,0,1,0,0,1,38.0,71.2833
2,1,0,0,0,1,3,26.0,7.9250
3,1,0,0,0,1,1,35.0,53.1000
4,0,1,0,0,1,3,35.0,8.0500

In [98]:
final_data.Fare.agg(['min','max','mean'])

min       0.000000
max     512.329200
mean     32.204208
Name: Fare, dtype: float64

In [97]:
final_data.Fare.sort_values(ascending=False)

679    512.3292
258    512.3292
737    512.3292
341    263.0000
438    263.0000
         ...
277      0.0000
633      0.0000
302      0.0000
597      0.0000
271      0.0000
Name: Fare, Length: 891, dtype: float64

In [93]:
final_data.isnull().sum()

Sex_female    0
Sex_male      0
Embarked_C    0
Embarked_Q    0
Embarked_S    0
Pclass        0
Age           0
Fare          0
dtype: int64

In [94]:
final_data.shape

(891, 8)

In [124]:
X

array([[0, 1],
       [1, 0],
       [1, 0],
       ...,
       [1, 0],
       [0, 1],
       [0, 1]], dtype=uint8)

In [112]:
X = pd.get_dummies(df1['Sex']).values
y = df.Survived.values

### build a model for making prediction

In [113]:
X.ndim

2

In [102]:
X = X.reshape(-1,1)

In [114]:
X.ndim

2

In [115]:
from sklearn.model_selection import train_test_split

In [116]:
xtrain,xtest,ytrain,ytest = train_test_split(X,y,test_size=.20,random_state=1)

In [117]:
from sklearn.linear_model import LogisticRegression

In [118]:
log = LogisticRegression()

In [119]:
log.fit(xtrain,ytrain)

/home/vinit/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [125]:
test = ['male']
test = [[0,1]]
#test1 = pd.get_dummies(test)
#log.predict(test)

In [122]:
test1

   male
0     1

In [126]:
log.predict(test)

array([0])

In [109]:
log.score(xtest,ytest)

0.5921787709497207

In [110]:
#50-->
df.select_dtypes(include=['object'])

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

## Missing Values

In [ ]:
#df=pd.read_excel('movies.xls',sheet_name=0)
#df.head()

In [8]:
df = pd.read_csv('new_data/dataset/weather_data.txt',parse_dates=['day'])

In [22]:
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        9.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08          NaN        NaN   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [16]:
df.day.dt.day_name()

0       Sunday
1    Wednesday
2     Thursday
3       Friday
4     Saturday
5       Sunday
6       Monday
7      Tuesday
8    Wednesday
Name: day, dtype: object

In [7]:
df['day'][0]

'1/1/2017'

### deal with missing values

In [19]:
df.isnull().sum()

day            0
temperature    4
windspeed      4
event          2
dtype: int64

In [21]:
#count missing values in a specfic column
#df.temperature.isnull().sum()
df[df.event.isnull()]

         day  temperature  windspeed event
3 2017-01-06          NaN        7.0   NaN
6 2017-01-09          NaN        NaN   NaN

In [10]:
df[df.temperature.isnull()]

        day  temperature  windspeed  event
1  1/4/2017          NaN        9.0  Sunny
3  1/6/2017          NaN        7.0    NaN
5  1/8/2017          NaN        NaN  Sunny
6  1/9/2017          NaN        NaN    NaN

### option 1: fill all Nan values with single value

In [11]:

new_df = df.fillna(4)
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          4.0        9.0   Sunny
2   1/5/2017         28.0        4.0    Snow
3   1/6/2017          4.0        7.0       4
4   1/7/2017         32.0        4.0    Rain
5   1/8/2017          4.0        4.0   Sunny
6   1/9/2017          4.0        4.0       4
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

### option 2:

In [23]:
df.temperature.mean()

33.2

In [24]:
#fill all nan values with a single value ,not a good solution

#so pandas provides an alternative for that
import numpy as np
new_df = df.fillna({
    'temperature':df.temperature.mean(),
    'windspeed':0,
    'event':'no event'
})
new_df

         day  temperature  windspeed     event
0 2017-01-01         32.0        6.0      Rain
1 2017-01-04         33.2        9.0     Sunny
2 2017-01-05         28.0        0.0      Snow
3 2017-01-06         33.2        7.0  no event
4 2017-01-07         32.0        0.0      Rain
5 2017-01-08         33.2        0.0     Sunny
6 2017-01-09         33.2        0.0  no event
7 2017-01-10         34.0        8.0    Cloudy
8 2017-01-11         40.0       12.0     Sunny

In [28]:
import numpy as np

In [31]:
df.loc[9]=[np.NaN,np.NaN,np.NaN,np.NaN]

In [32]:
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        9.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08          NaN        NaN   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny
9        NaT          NaN        NaN     NaN

In [34]:
# drop a row having all columns are nan values
new_df = df.dropna(how='any')  #all or any   axis=0

new_df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

### replace function

In [37]:
new_df = pd.read_csv('new_data/dataset/weather_data2.txt')

In [ ]:
50K

In [38]:
new_df

         day  temperature  windspeed     event
0   1/1/2017           32          6      Rain
1   1/4/2017       -99999          9     Sunny
2   1/5/2017           28     -99999      Snow
3   1/6/2017       -99999          7  No event
4   1/7/2017           32     -88888      Rain
5  1/11/2017           40         12  No event

### suppose we have some weird/unusual values instead of nan values

In [39]:
newdf=new_df.replace([-99999,-88888],np.nan)

In [40]:
newdf

         day  temperature  windspeed     event
0   1/1/2017         32.0        6.0      Rain
1   1/4/2017          NaN        9.0     Sunny
2   1/5/2017         28.0        NaN      Snow
3   1/6/2017          NaN        7.0  No event
4   1/7/2017         32.0        NaN      Rain
5  1/11/2017         40.0       12.0  No event

In [41]:
# we can do same thing with dictionary
new_df = new_df.replace({
    'temperature':-99999,
    'windspeed':[-99999,-88888],
    'event':'No event'
},np.nan)

In [42]:
new_df

         day  temperature  windspeed  event
0   1/1/2017         32.0        6.0   Rain
1   1/4/2017          NaN        9.0  Sunny
2   1/5/2017         28.0        NaN   Snow
3   1/6/2017          NaN        7.0    NaN
4   1/7/2017         32.0        NaN   Rain
5  1/11/2017         40.0       12.0    NaN

In [50]:
df4=pd.read_csv('try.txt',header=None,names=['A','B','C'])
df4

    A    B    C
0  12  abc    ?
1  13    *    d
2   *   kj  NaN

In [52]:
df4['A'][0]

'12'

In [51]:
df4.dtypes

A    object
B    object
C    object
dtype: object

In [49]:
df4.isnull().sum()

A    1
B    1
C    2
dtype: int64

In [53]:
import string

In [55]:
d=string.punctuation
d

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'

In [56]:
for i in df4['A']:
    if i in d:
        print(i)

*